# GET - открытие браузера + параметры
# POST - отправка данных
# PUT/PATCH - оброваления
# put - ресурс целиком
# patch - частично
# delete - удаляет

# MVC - model view controller
# разделение всей информации на различные зависимые блоки
# работа ресторана
# 1. предоставляется меню (вью)
# 2. заказ пиццы - контроллер
# 3. повар - информация о данных (продукты грибы сыр т)
# 4. на кухне в контролле готовится пицца

# django - конструктор django.projects.com

# виртуальное окружение pip install
# docker - создать контейнер  отдельная система со своим собственным окружением
# create virtual enviroment
# venv python3 - venv
