# Одежда для новорождённых и малышей (от 0 до 3)

# Россия	Европа
# EU	Англия
# UK	США
# US	Грудь,
# см	Рост,
# см	Возраст,
# мес
# 18	56	2	0/3	36	56	0-2
# 18-20	58	2	0/3	38	58	3
# 20	62	2	3/6	40	62	4
# 20-22	68	2	3/6	44	68	6
# 22	74	2	6/9	44	74	9
# 24	80	2	S/M	48	80	12
# 26	86	2	2-2T	52	86	18
# 28	92	3	2-2T	52	92	24

def convert_from_month(country, size):
    sizes = ["0-2", "3", "4", "6", "9", "12", "18", "24"]
    countries = {
        "Russia": ["18", "18-20", "20", "20-22", "22", "24", "26", "28"],
        "EU": ["56", "58", "62", "68", "74", "80", "86", "92"],
        "UK": [*["2"] * 7, "3"],
        "US": [*["0/3"] * 2, *["3/6"] * 2, "6/9", "S/M", *["2-2T"] * 2]
    }

    if size in sizes and country in countries:
        return countries[country][sizes.index(size)]
    else:
        return None


print(convert_from_month("UK", "3"))
